In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplay where song_id is NOT NULL LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
2 rows affected.

[(3225, datetime.datetime(2018, 11, 21, 21, 56, 47, 796000), '15', 'paid', 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (10045, datetime.datetime(2018, 11, 21, 21, 56, 47, 796000), '15', 'paid', 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('48', 'Marina', 'Sutton', 'F', 'free'),
 ('30', 'Avery', 'Watkins', 'F', 'paid'),
 ('73', 'Jacob', 'Klein', 'M', 'paid'),
 ('24', 'Layla', 'Griffin', 'F', 'paid'),
 ('6', 'Cecilia', 'Owens', 'F', 'free')]

In [5]:
%sql SELECT * FROM song LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOINLJW12A8C13314C', 'City Slickers', 'AR8IEZO1187B99055E', 2008, Decimal('149.86404')),
 ('SOGDBUF12A8C140FAA', 'Intro', 'AR558FS1187FB45658', 2003, Decimal('75.67628')),
 ('SORRZGD12A6310DBC3', 'Harajuku Girls', 'ARVBRGZ1187FB4675A', 2004, Decimal('290.55955')),
 ('SONWXQJ12A8C134D94', 'The Ballad Of Sleeping Beauty', 'ARNF6401187FB57032', 1994, Decimal('305.162')),
 ('SOFCHDR12AB01866EF', 'Living Hell', 'AREVWGE1187B9B890A', 0, Decimal('282.43546'))]

In [6]:
%sql SELECT * FROM artist LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('AR8IEZO1187B99055E', 'Marc Shaiman', 'NaN', 'NaN', ''),
 ('AR558FS1187FB45658', '40 Grit', 'NaN', 'NaN', ''),
 ('ARVBRGZ1187FB4675A', 'Gwen Stefani', 'NaN', 'NaN', ''),
 ('ARNF6401187FB57032', 'Sophie B. Hawkins', '-73.96644', '40.79086', 'New York, NY [Manhattan]'),
 ('AREVWGE1187B9B890A', 'Bitter End', '-41.9952', '-13.442', 'Noci (BA)')]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(1970, 1, 18, 20, 44, 9, 657796), 20, 18, 3, 1, 1970, 6.0),
 (datetime.datetime(1970, 1, 18, 20, 44, 9, 690796), 20, 18, 3, 1, 1970, 6.0),
 (datetime.datetime(1970, 1, 18, 20, 44, 9, 841796), 20, 18, 3, 1, 1970, 6.0),
 (datetime.datetime(1970, 1, 18, 20, 44, 9, 895796), 20, 18, 3, 1, 1970, 6.0),
 (datetime.datetime(1970, 1, 18, 20, 44, 10, 33796), 20, 18, 3, 1, 1970, 6.0)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).